# NewtonsPerSquareMillimeter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..NewtonsPerSquareMillimeter Property
UnitTypeId Class See Also
---
Newtons per square millimeter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId NewtonsPerSquareMillimeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NewtonsPerSquareMillimeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NewtonsPerSquareMillimeter {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace